init.org
** go-eldoc
#+BEGIN_SRC emacs-lisp
(require 'go-eldoc)
(add-hook 'go-mode-hook 'go-eldoc-setup)
(set-face-attribute 'eldoc-highlight-function-argument nil
                    :underline t :foreground "darkgreen"
                    :weight 'bold)
#+END_SRC
** Oracle
#+BEGIN_SRC emacs-lisp
;;(setq go-oracle-command "/usr/bin/oracle")
#+END_SRC
** go-rename
#+BEGIN_SRC emacs-lisp
(require 'go-rename)
#+END_SRC

** auto-complete
#+BEGIN_SRC emacs-lisp
(require 'auto-complete-config)
(add-to-list 'ac-dictionary-directories (concat (getenv "GOPATH") "/src/github.com/auto-complete/auto-complete/dict"))
(require 'go-autocomplete)
(ac-config-default)
(ac-set-trigger-key "TAB")
#+END_SRC

** yasnippet
#+BEGIN_SRC emacs-lisp
(require 'yasnippet)
(add-to-list 'yas-snippet-dirs (concat (getenv "GOPATH") "/src/github.com/atotto/yasnippet-golang"))
(yas-reload-all)
(add-hook 'go-mode-hook #'yas-minor-mode)
;;(yas-global-mode 1)
#+END_SRC
** auto insert templete for go files
#+BEGIN_SRC emacs-lisp
(require 'autoinsert)
(setq auto-insert-directory "~/.emacs.d/_templates/")
(define-auto-insert "\\.go\\'" "T.go")
(define-auto-insert "\\test.go\\'" "T_test.go")
(add-hook 'find-file-hooks 'auto-insert)
#+END_SRC

* Helm
#+BEGIN_SRC emacs-lisp
;;(require 'helm-config)
;;(helm-mode 1)
;;
;;(global-set-key (kbd "M-x")                          'undefined)
;;(global-set-key (kbd "M-x")                          'helm-M-x)
;;(global-set-key (kbd "M-y")                          'helm-show-kill-ring)
;;(global-set-key (kbd "C-c f")                        'helm-recentf)
;;(global-set-key (kbd "C-x C-f")                      'helm-find-files)
;;(global-set-key (kbd "C-c <SPC>")                    'helm-all-mark-rings)
;;(global-set-key (kbd "C-x r b")                      'helm-filtered-bookmarks)
;;(global-set-key (kbd "C-h r")                        'helm-info-emacs)
;;(global-set-key (kbd "C-:")                          'helm-eval-expression-with-eldoc)
;;(global-set-key (kbd "C-,")                          'helm-calcul-expression)
;;(global-set-key (kbd "C-h i")                        'helm-info-at-point)
;;(global-set-key (kbd "C-x C-d")                      'helm-browse-project)
;;(global-set-key (kbd "<f1>")                         'helm-resume)
;;(global-set-key (kbd "C-h C-f")                      'helm-apropos)
;;(global-set-key (kbd "C-h a")                        'helm-apropos)
;;(global-set-key (kbd "<f5> s")                       'helm-find)
;;(global-set-key (kbd "<f2>")                         'helm-execute-kmacro)
;;(global-set-key (kbd "C-c g")                        'helm-gid)
;;(global-set-key (kbd "C-c i")                        'helm-imenu-in-all-buffers)
;;;;(global-set-key (kbd "<f11> o")                      'helm-org-agenda-files-headings)
;;(global-set-key (kbd "C-s")                          'helm-occur)
;;(define-key global-map [remap jump-to-register]      'helm-register)
;;(define-key global-map [remap list-buffers]          'helm-buffers-list)
;;(define-key global-map [remap dabbrev-expand]        'helm-dabbrev)
;;(define-key global-map [remap find-tag]              'helm-etags-select)
;;(define-key global-map [remap xref-find-definitions] 'helm-etags-select)
;;(define-key global-map (kbd "M-g a")                 'helm-do-grep-ag)
;;(define-key global-map (kbd "M-g g")                 'helm-grep-do-git-grep)
#+END_SRC
* Ido
#+BEGIN_SRC emacs-lisp
(ido-mode 1)
(ido-everywhere 1)
(require 'ido-ubiquitous)
(ido-ubiquitous-mode 1)
#+END_SRC
* Smex
#+BEGIN_SRC emacs-lisp
(smex-initialize)
(global-set-key (kbd "M-x") 'smex)
(global-set-key (kbd "M-X") 'smex-major-mode-commands)
(require 'smex)
#+END_SRC
* Markdown
#+BEGIN_SRC emacs-lisp
(autoload 'markdown-mode "markdown-mode"
   "Major mode for editing Markdown files" t)
(add-to-list 'auto-mode-alist '("\\.text\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("\\.markdown\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
#+END_SRC
* Python
** jedi
#+begin_src emacs-lisp
(add-hook 'python-mode-hook 'jedi:setup)
(setq jedi:complete-on-dot t)                 ; optional
#+end_src
* Auctex
#+begin_src emacs-lisp
;; auctex
;; (load "auctex.el" nil t t)
;; (load "preview-latex.el" nil t t)
;;(setq TeX-output-view-style
;;      (quote
;;       (("^pdf$" "." "evince -f %o")
;;        ("^html?$" "." "google-chrome-stable %o"))))
#+end_src
* Unicad is Awesome
#+begin_src emacs-lisp
(setq load-path
      (append (list "~/.emacs.d/site-lisp")
                      load-path))
(require 'unicad)
#+end_src
* Server Start
#+begin_src emacs-lisp
(server-start)
#+end_src
* auto-fill-mode for text files
#+begin_src emacs-lisp
(setq text-mode-hook '(lambda()  
                        (auto-fill-mode t) 
                        )) 
#+end_src
* ecb
#+begin_src emacs-lisp
;;'(require 'ecb-autoloads)
#+end_src
* jsp
#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '("\\.jsp\\'" . html-mode))
#+end_src
* popwin
popwin to eliminate all these *help* *message* buffers
#+begin_src emacs-lisp
;;(require 'popwin)
;;(popwin-mode 1)
#+end_src
* jsx
#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '("\\.jsx\\'" . jsx-mode))
(autoload 'jsx-mode "jsx-mode" "JSX mode" t)
#+end_src
* tramp
#+begin_src emacs-lisp
(setq tramp-default-method "ssh")
#+end_src
* json-reformat
#+begin_src emacs-lisp
(setq json-reformat:pretty-string? 1)
#+end_src
