init.el

(require 'go-eldoc)
(add-hook 'go-mode-hook 'go-eldoc-setup)
(set-face-attribute 'eldoc-highlight-function-argument nil
                    :underline t :foreground "darkgreen"
                    :weight 'bold)

;;(setq go-oracle-command "/usr/bin/oracle")

(require 'go-rename)

(require 'auto-complete-config)
(add-to-list 'ac-dictionary-directories (concat (getenv "GOPATH") "/src/github.com/auto-complete/auto-complete/dict"))
(require 'go-autocomplete)
(ac-config-default)
(ac-set-trigger-key "TAB")

(require 'yasnippet)
(add-to-list 'yas-snippet-dirs (concat (getenv "GOPATH") "/src/github.com/atotto/yasnippet-golang"))
(yas-reload-all)
(add-hook 'go-mode-hook #'yas-minor-mode)
;;(yas-global-mode 1)

(require 'autoinsert)
(setq auto-insert-directory "~/.emacs.d/_templates/")
(define-auto-insert "\\.go\\'" "T.go")
(define-auto-insert "\\test.go\\'" "T_test.go")
(add-hook 'find-file-hooks 'auto-insert)

;;(require 'helm-config)
;;(helm-mode 1)
;;
;;(global-set-key (kbd "M-x")                          'undefined)
;;(global-set-key (kbd "M-x")                          'helm-M-x)
;;(global-set-key (kbd "M-y")                          'helm-show-kill-ring)
;;(global-set-key (kbd "C-c f")                        'helm-recentf)
;;(global-set-key (kbd "C-x C-f")                      'helm-find-files)
;;(global-set-key (kbd "C-c <SPC>")                    'helm-all-mark-rings)
;;(global-set-key (kbd "C-x r b")                      'helm-filtered-bookmarks)
;;(global-set-key (kbd "C-h r")                        'helm-info-emacs)
;;(global-set-key (kbd "C-:")                          'helm-eval-expression-with-eldoc)
;;(global-set-key (kbd "C-,")                          'helm-calcul-expression)
;;(global-set-key (kbd "C-h i")                        'helm-info-at-point)
;;(global-set-key (kbd "C-x C-d")                      'helm-browse-project)
;;(global-set-key (kbd "<f1>")                         'helm-resume)
;;(global-set-key (kbd "C-h C-f")                      'helm-apropos)
;;(global-set-key (kbd "C-h a")                        'helm-apropos)
;;(global-set-key (kbd "<f5> s")                       'helm-find)
;;(global-set-key (kbd "<f2>")                         'helm-execute-kmacro)
;;(global-set-key (kbd "C-c g")                        'helm-gid)
;;(global-set-key (kbd "C-c i")                        'helm-imenu-in-all-buffers)
;;;;(global-set-key (kbd "<f11> o")                      'helm-org-agenda-files-headings)
;;(global-set-key (kbd "C-s")                          'helm-occur)
;;(define-key global-map [remap jump-to-register]      'helm-register)
;;(define-key global-map [remap list-buffers]          'helm-buffers-list)
;;(define-key global-map [remap dabbrev-expand]        'helm-dabbrev)
;;(define-key global-map [remap find-tag]              'helm-etags-select)
;;(define-key global-map [remap xref-find-definitions] 'helm-etags-select)
;;(define-key global-map (kbd "M-g a")                 'helm-do-grep-ag)
;;(define-key global-map (kbd "M-g g")                 'helm-grep-do-git-grep)

(ido-mode 1)
(ido-everywhere 1)
(require 'ido-ubiquitous)
(ido-ubiquitous-mode 1)

(smex-initialize)
(global-set-key (kbd "M-x") 'smex)
(global-set-key (kbd "M-X") 'smex-major-mode-commands)
(require 'smex)

(autoload 'markdown-mode "markdown-mode"
   "Major mode for editing Markdown files" t)
(add-to-list 'auto-mode-alist '("\\.text\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("\\.markdown\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))

(add-hook 'python-mode-hook 'jedi:setup)
(setq jedi:complete-on-dot t)                 ; optional

;; auctex
;; (load "auctex.el" nil t t)
;; (load "preview-latex.el" nil t t)
;;(setq TeX-output-view-style
;;      (quote
;;       (("^pdf$" "." "evince -f %o")
;;        ("^html?$" "." "google-chrome-stable %o"))))

(setq load-path
      (append (list "~/.emacs.d/site-lisp")
                      load-path))
(require 'unicad)

(server-start)

(setq text-mode-hook '(lambda()  
                        (auto-fill-mode t) 
                        )) 

;;'(require 'ecb-autoloads)

(add-to-list 'auto-mode-alist '("\\.jsp\\'" . html-mode))

;;(require 'popwin)
;;(popwin-mode 1)

(add-to-list 'auto-mode-alist '("\\.jsx\\'" . jsx-mode))
(autoload 'jsx-mode "jsx-mode" "JSX mode" t)

(setq tramp-default-method "ssh")

(setq json-reformat:pretty-string? 1)
